Python 3.6.6 (v3.6.6:4cf1f54eb7, Jun 27 2018, 03:37:03) [MSC v.1900 64 bit (AMD64)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> import random
      def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while true:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
                      
SyntaxError: multiple statements found while compiling a single statement
>>> import random;
      def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while true:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
                      
SyntaxError: multiple statements found while compiling a single statement
>>> import random
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while true:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")

                      
>>> choose_number()
Введите число от 1 до 3:    1
Traceback (most recent call last):
  File "<pyshell#5>", line 1, in <module>
    choose_number()
  File "<pyshell#4>", line 4, in choose_number
    while true:
NameError: name 'true' is not defined
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")

                      
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Не угадали
Traceback (most recent call last):
  File "<pyshell#8>", line 1, in <module>
    choose_number()
  File "<pyshell#7>", line 6, in choose_number
    print("Не угадали")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
        return 0
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
return 0
SyntaxError: invalid syntax
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
        return 0
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
               else:
                      print("Вы угадали")
        return choose_number
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
                      return choose_number()
               else:
                      print("Вы угадали")
                      return 0

                
>>> choose_number
<function choose_number at 0x00000000032F1620>
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали
Введите число от 1 до 3:    2
Не угадали
Введите число от 1 до 3:    3
Не угадали
Введите число от 1 до 3:    3
Не угадали
Введите число от 1 до 3:    2
Не угадали
Введите число от 1 до 3:    1
Не угадали
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#19>", line 1, in <module>
    choose_number()
  File "<pyshell#17>", line 7, in choose_number
    return choose_number()
  File "<pyshell#17>", line 7, in choose_number
    return choose_number()
  File "<pyshell#17>", line 7, in choose_number
    return choose_number()
  [Previous line repeated 2 more times]
  File "<pyshell#17>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>>  def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали", a)
                      return choose_number()
               else:
                      print("Вы угадали")
                      return 0
                
SyntaxError: unexpected indent
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали")
                      return choose_number()
               else:
                      print("Вы угадали")
                      return 0

                
>>> 
>>>  def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали",a)
                      return choose_number()
               else:
                      print("Вы угадали")
                      return 0
                
SyntaxError: unexpected indent
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали", a)
                      return choose_number()
               else:
                      print("Вы угадали")
                      return 0

                
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали 2
Введите число от 1 до 3:    2
Не угадали 2
Введите число от 1 до 3:    3
Не угадали 1
Введите число от 1 до 3:    1
Не угадали 1
Введите число от 1 до 3:    2
Не угадали 2
Введите число от 1 до 3:    3
Не угадали 1
Введите число от 1 до 3:    1
Не угадали 3
Введите число от 1 до 3:    3
Не угадали 1
Введите число от 1 до 3:    3
Не угадали 2
Введите число от 1 до 3:    2
Не угадали 3
Введите число от 1 до 3:    2
Не угадали 3
Введите число от 1 до 3:    2
Не угадали 1
Введите число от 1 до 3:    2
Не угадали 1
Введите число от 1 до 3:    2
Не угадали 2
Введите число от 1 до 3:    2
Не угадали 2
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#27>", line 1, in <module>
    choose_number()
  File "<pyshell#26>", line 7, in choose_number
    return choose_number()
  File "<pyshell#26>", line 7, in choose_number
    return choose_number()
  File "<pyshell#26>", line 7, in choose_number
    return choose_number()
  [Previous line repeated 11 more times]
  File "<pyshell#26>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while True:
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0

                
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    4
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#30>", line 1, in <module>
    choose_number()
  File "<pyshell#29>", line 7, in choose_number
    return choose_number()
  File "<pyshell#29>", line 7, in choose_number
    return choose_number()
  File "<pyshell#29>", line 7, in choose_number
    return choose_number()
  [Previous line repeated 15 more times]
  File "<pyshell#29>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
                
SyntaxError: unexpected indent
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4)
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
                
SyntaxError: invalid syntax
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
		       print("Ошибка! Введенное число не попадает в диапазон")
		       
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
		      print("Ошибка! Введенное число не попадает в диапазон")
		      
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
		print("Ошибка! Введенное число не попадает в диапазон")
		
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0

                
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#40>", line 1, in <module>
    choose_number()
  File "<pyshell#39>", line 7, in choose_number
    return choose_number()
  File "<pyshell#39>", line 7, in choose_number
    return choose_number()
  File "<pyshell#39>", line 7, in choose_number
    return choose_number()
  [Previous line repeated 12 more times]
  File "<pyshell#39>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		      print("Вы угадали")
                      return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
		       print("Не угадали! Компьютер загадал число: ", a)return choose_number()
		       
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		      print("Вы угадали")
                      return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> 
>>> 
>>> 
>>> 
>>> 
>>> 
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
print("Вы угадали")
return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: expected an indented block
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
		       print("Вы угадали")
		       return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	while (a > 0) and (a < 4):
               if a==b:
                   print("Вы угадали")
                   return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()

                
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#58>", line 1, in <module>
    choose_number()
  File "<pyshell#57>", line 10, in choose_number
    return choose_number()
  File "<pyshell#57>", line 10, in choose_number
    return choose_number()
  File "<pyshell#57>", line 10, in choose_number
    return choose_number()
  [Previous line repeated 13 more times]
  File "<pyshell#57>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
        if a==b:
                   print("Вы угадали")
                   return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	if a==b:
                   print("Вы угадали")
                   return 0  
               elif a!=b:
                     print("Не угадали! Компьютер загадал число: ", a)
                     return choose_number()
                
SyntaxError: unindent does not match any outer indentation level
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	if a==b:
	    print("Вы угадали")
	    return 0
	else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        return choose_number()

	
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    23
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#63>", line 1, in <module>
    choose_number()
  File "<pyshell#62>", line 9, in choose_number
    return choose_number()
  File "<pyshell#62>", line 9, in choose_number
    return choose_number()
  File "<pyshell#62>", line 9, in choose_number
    return choose_number()
  [Previous line repeated 13 more times]
  File "<pyshell#62>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	if a==b:
	    print("Вы угадали")
	    return 0
	else:
	        print("Не угадали! Компьютер загадал число: ", a,b)
	        return choose_number()

	
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1 1
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#66>", line 1, in <module>
    choose_number ()
  File "<pyshell#65>", line 9, in choose_number
    return choose_number()
  File "<pyshell#65>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = input ("Введите число от 1 до 3:    ")
	p = 0
	while p < 20:
	    if a==b:
	        print("Вы угадали")
	        return 0
	    else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        return choose_number()

	
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    23
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#69>", line 1, in <module>
    choose_number ()
  File "<pyshell#68>", line 11, in choose_number
    return choose_number()
  File "<pyshell#68>", line 11, in choose_number
    return choose_number()
  File "<pyshell#68>", line 11, in choose_number
    return choose_number()
  [Previous line repeated 7 more times]
  File "<pyshell#68>", line 3, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	
	p = 0
	while p < 20:
		b = input ("Введите число от 1 до 3:    ")
	    if a==b:
	        print("Вы угадали")
	        return 0
	    else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        return choose_number()
	
SyntaxError: unindent does not match any outer indentation level
>>> def choose_number ():
	a = random.randint (1,3)
	p = 0
	while p < 20:
	b = input ("Введите число от 1 до 3:    ")
	    if a==b:
	        print("Вы угадали")
	        return 0
	    else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        return choose_number()
	
SyntaxError: expected an indented block
>>> def choose_number ():
	a = random.randint (1,3)
	p = 0
	while p < 20:
	    b = input ("Введите число от 1 до 3:    ")
	    if a==b:
	        print("Вы угадали")
	        return 0
	    else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        return choose_number()

	
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#74>", line 1, in <module>
    choose_number ()
  File "<pyshell#73>", line 11, in choose_number
    return choose_number()
  File "<pyshell#73>", line 11, in choose_number
    return choose_number()
  File "<pyshell#73>", line 11, in choose_number
    return choose_number()
  File "<pyshell#73>", line 5, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	p = 0
	while p < 20:
	    b = input ("Введите число от 1 до 3:    ")
	    if a==b:
	        print("Вы угадали")
	        return 0
	    else:
	        print("Не угадали! Компьютер загадал число: ", a)
	        p += 1
	    if p == 10:
		    print("sorry", a)

		    
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#79>", line 1, in <module>
    choose_number ()
  File "<pyshell#78>", line 5, in choose_number
    b = input ("Введите число от 1 до 3:    ")
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
		      print("Ошибка! Введенное число не попадает в диапазон")
		      
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	while (a > 0) and (a < 4):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
                   print("Ошибка! Введенное число не попадает в диапазон")

                   
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Вы угадали
0
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while (a > 0) and (a < 4) and (p < 5):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      return 0
               else:
                   print("Ошибка! Введенное число не попадает в диапазон")
                   return choose_number()

                
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  3
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Вы угадали
0
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while (a > 0) and (a < 4) and (p < 5):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      break
               else:
                   print("Ошибка! Введенное число не попадает в диапазон")
                   return choose_number()

                
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Вы угадали
>>> choose_number()
Введите число от 1 до 3:    9
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#91>", line 1, in <module>
    choose_number()
  File "<pyshell#89>", line 8, in choose_number
    return choose_number()
  File "<pyshell#89>", line 3, in choose_number
    b = int(input ("Введите число от 1 до 3:    "))
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while (b > 0) and (b < 4) and (p < 5):
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      break
               else:
                   print("Ошибка! Введенное число не попадает в диапазон")
                   return choose_number()

                
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    8
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while p < 5:
               if a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      break
               elif (b < 1) and (b > 3):
                   print("Ошибка! Введенное число не попадает в диапазон")
                   return choose_number()

                
>>> choose_number ()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    7
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#97>", line 1, in <module>
    choose_number ()
  File "<pyshell#96>", line 8, in choose_number
    return choose_number()
  File "<pyshell#96>", line 8, in choose_number
    return choose_number()
  File "<pyshell#96>", line 3, in choose_number
    b = int(input ("Введите число от 1 до 3:    "))
KeyboardInterrupt
>>>  def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while p < 5:
	       if (b < 1) and (b > 3):
                      print("Ошибка! Введенное число не попадает в диапазон")
                      return choose_number()
               elif a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      break
                
SyntaxError: unexpected indent
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while p < 5:
	       if (b < 1) and (b > 3):
                      print("Ошибка! Введенное число не попадает в диапазон")
                      return choose_number()
               elif a!=b:
                      print("Не угадали! Компьютер загадал число: ", a)
                      return choose_number()
                      p += 1
               elif a==b:
                      print("Вы угадали")
                      break
                
SyntaxError: inconsistent use of tabs and spaces in indentation
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while p < 5:
	    if (b < 1) and (b > 3):
	        print("Ошибка! Введенное число не попадает в диапазон")
	        return choose_number()
	    elif a!=b:
	            print("Не угадали! Компьютер загадал число: ", a)
	            return choose_number()
	            p += 1
	    elif a==b:
	                print("Вы угадали")
	    break

	
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    8
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    9
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    
Traceback (most recent call last):
  File "<pyshell#102>", line 1, in <module>
    choose_number()
  File "<pyshell#101>", line 11, in choose_number
    return choose_number()
  File "<pyshell#101>", line 11, in choose_number
    return choose_number()
  File "<pyshell#101>", line 11, in choose_number
    return choose_number()
  File "<pyshell#101>", line 3, in choose_number
    b = int(input ("Введите число от 1 до 3:    "))
KeyboardInterrupt
>>> def choose_number ():
	a = random.randint (1,3)
	b = int(input ("Введите число от 1 до 3:    "))
	p = 0
	while p < 5:
	    if a!=b:
	            print("Не угадали! Компьютер загадал число: ", a)
	            return choose_number()
	            p += 1
	    elif a==b:
	                print("Вы угадали")
	    break

	
>>> choose_number()
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    3
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    2
Не угадали! Компьютер загадал число:  1
Введите число от 1 до 3:    1
Не угадали! Компьютер загадал число:  2
Введите число от 1 до 3:    1
Вы угадали
>>> def choose_number ():
	a = random.randint (1,100)
	b = int(input ("Введите число от 1 до 100:    "))
	p = 0
	while p < 15:
	    elif a!=b:
	            print("Не угадали! Компьютер загадал число: ", a)
	            return choose_number()
	            p += 1
	    elif a==b:
	                print("Вы угадали")
	    break
	
SyntaxError: invalid syntax
>>> def choose_number ():
	a = random.randint (1,100)
	b = int(input ("Введите число от 1 до 100:    "))
	p = 0
	while p < 15:
	    if a!=b:
	            print("Не угадали! Компьютер загадал число: ", a)
	            return choose_number()
	            p += 1
	    elif a==b:
	                print("Вы угадали")
	    break

	
>>> choose_number()
Введите число от 1 до 100:    2
Не угадали! Компьютер загадал число:  95
Введите число от 1 до 100:    4
Не угадали! Компьютер загадал число:  49
Введите число от 1 до 100:    1
Не угадали! Компьютер загадал число:  18
Введите число от 1 до 100:    5
Не угадали! Компьютер загадал число:  98
Введите число от 1 до 100:    5447
Не угадали! Компьютер загадал число:  11
Введите число от 1 до 100:    
Traceback (most recent call last):
  File "<pyshell#109>", line 1, in <module>
    choose_number()
  File "<pyshell#108>", line 8, in choose_number
    return choose_number()
  File "<pyshell#108>", line 8, in choose_number
    return choose_number()
  File "<pyshell#108>", line 8, in choose_number
    return choose_number()
  [Previous line repeated 1 more times]
  File "<pyshell#108>", line 3, in choose_number
    b = int(input ("Введите число от 1 до 100:    "))
ValueError: invalid literal for int() with base 10: ''
>>> 
>>> 
>>> choose_number()

